#ifndef DUAL_SENSE_H
#define DUAL_SENSE_H

#pragma once

#include <stdint.h>
#include "util.h"

#pragma pack(push, 1)

/* HID input report id */
#define DUAL_SENSE_BT_REPORT_INPUT_ID01 0x01
/* HID output report id */
#define DUAL_SENSE_BT_REPORT_OUTPUT_ID31 0x31
#define DUAL_SENSE_BT_REPORT_OUTPUT_ID32 0x32
#define DUAL_SENSE_BT_REPORT_OUTPUT_ID33 0x33
#define DUAL_SENSE_BT_REPORT_OUTPUT_ID34 0x34
#define DUAL_SENSE_BT_REPORT_OUTPUT_ID35 0x35
#define DUAL_SENSE_BT_REPORT_OUTPUT_ID36 0x36
#define DUAL_SENSE_BT_REPORT_OUTPUT_ID37 0x37
#define DUAL_SENSE_BT_REPORT_OUTPUT_ID38 0x38
#define DUAL_SENSE_BT_REPORT_OUTPUT_ID39 0x39
/* HID feature report id */
#define DUAL_SENSE_BT_REPORT_FEATURE_ID05 0x05
#define DUAL_SENSE_BT_REPORT_FEATURE_ID08 0x08
#define DUAL_SENSE_BT_REPORT_FEATURE_ID09 0x09
#define DUAL_SENSE_BT_REPORT_FEATURE_ID20 0x20
#define DUAL_SENSE_BT_REPORT_FEATURE_ID22 0x22
#define DUAL_SENSE_BT_REPORT_FEATURE_ID80 0x80
#define DUAL_SENSE_BT_REPORT_FEATURE_ID81 0x81
#define DUAL_SENSE_BT_REPORT_FEATURE_ID82 0x82
#define DUAL_SENSE_BT_REPORT_FEATURE_ID83 0x83
#define DUAL_SENSE_BT_REPORT_FEATURE_IDF0 0xF0
#define DUAL_SENSE_BT_REPORT_FEATURE_IDF1 0xF1
#define DUAL_SENSE_BT_REPORT_FEATURE_IDF2 0xF2

/* HID input report id */
#define DUAL_SENSE_USB_REPORT_INPUT_ID01 0x01
/* HID output report id */
#define DUAL_SENSE_USB_REPORT_OUTPUT_ID02 0x02
/* HID feature report id */
#define DUAL_SENSE_USB_REPORT_FEATURE_ID05 0x05
#define DUAL_SENSE_USB_REPORT_FEATURE_ID08 0x08

        0x85, 0xF4,       /*   Report ID (244) */                                                                     \
        0x09, 0x35,       /*   Usage (0x35) */                                                                        \
        0x95, 0x3F,       /*   Report Count (63) */                                                                   \
        0xB1, 0x02,       /*   Feature (Data,Var,Abs,No Wrap,Linear,Preferred State,No Null Position,Non-volatile) */ \
        0x85, 0xF5,       /*   Report ID (245) */                                                                     \
        0x09, 0x36,       /*   Usage (0x36) */                                                                        \
        0x95, 0x03,       /*   Report Count (3) */                                                                    \
        0xB1, 0x02,       /*   Feature (Data,Var,Abs,No Wrap,Linear,Preferred State,No Null Position,Non-volatile) */ \
        0xC0              /* End Collection */
// 273 bytes

// C++11 allows setting enum base type. If enum sizes cannot be assured please use the indicated base types instead of the enum types.
enum DualSense_Direction
{
    DualSense_Direction_North = 0,
    DualSense_Direction_NorthEast,
    DualSense_Direction_East,
    DualSense_Direction_SouthEast,
    DualSense_Direction_South,
    DualSense_Direction_SouthWest,
    DualSense_Direction_West,
    DualSense_Direction_NorthWest,
    DualSense_Direction_None = 8
};

enum DualSense_PowerState
{
    DualSense_PowerState_Discharging = 0x00,         // Use PowerPercent
    DualSense_PowerState_Charging = 0x01,            // Use PowerPercent
    DualSense_PowerState_Complete = 0x02,            // PowerPercent not valid? assume 100%?
    DualSense_PowerState_AbnormalVoltage = 0x0A,     // PowerPercent not valid?
    DualSense_PowerState_AbnormalTemperature = 0x0B, // PowerPercent not valid?
    DualSense_PowerState_ChargingError = 0x0F        // PowerPercent not valid?
};

enum DualSense_MuteLight
{
    DualSense_MuteLight_Off = 0,
    DualSense_MuteLight_On,
    DualSense_MuteLight_Breathing,
    DualSense_MuteLight_DoNothing, // literally nothing, this input is ignored,
                                   // though it might be a faster blink in other versions
    DualSense_MuteLight_NoAction4,
    DualSense_MuteLight_NoAction5,
    DualSense_MuteLight_NoAction6,
    DualSense_MuteLight_NoAction7 = 7
};

enum DualSense_LightBrightness
{
    DualSense_LightBrightness_Bright = 0,
    DualSense_LightBrightness_Mid,
    DualSense_LightBrightness_Dim,
    DualSense_LightBrightness_NoAction3,
    DualSense_LightBrightness_NoAction4,
    DualSense_LightBrightness_NoAction5,
    DualSense_LightBrightness_NoAction6,
    DualSense_LightBrightness_NoAction7 = 7
};

enum DualSense_LightFadeAnimation
{
    DualSense_LightFadeAnimation_Nothing = 0,
    DualSense_LightFadeAnimation_FadeIn, // from black to blue
    DualSense_LightFadeAnimation_FadeOut // from blue to black
};

// template<int N> struct BTCRC {
//     uint8_t[N-4] Buff;
//     uint32_t CRC;
// };

#define DualSense_BTCRC(N)   \
    struct                   \
    {                        \
        uint8_t Buff[N - 4]; \
        uint32_t CRC;        \
    }

/* ****** Input Reports ****** */

struct DualSense_TouchFingerData
{ // 4
    /*0.0*/ uint32_t Index : 7;
    /*0.7*/ uint32_t NotTouching : 1;
    /*1.0*/ uint32_t FingerX : 12;
    /*2.4*/ uint32_t FingerY : 12;
};

struct DualSense_TouchData
{ // 9
    /*0*/ struct DualSense_TouchFingerData Finger[2];
    /*8*/ uint8_t Timestamp;
};

struct DualSense_BTSimpleGetStateData
{ // 9
    /*0  */ uint8_t LeftStickX;
    /*1  */ uint8_t LeftStickY;
    /*2  */ uint8_t RightStickX;
    /*3  */ uint8_t RightStickY;
    /*4.0*/ enum DualSense_Direction DPad : 4;
    /*4.4*/ uint8_t ButtonSquare : 1;
    /*4.5*/ uint8_t ButtonCross : 1;
    /*4.6*/ uint8_t ButtonCircle : 1;
    /*4.7*/ uint8_t ButtonTriangle : 1;
    /*5.0*/ uint8_t ButtonL1 : 1;
    /*5.1*/ uint8_t ButtonR1 : 1;
    /*5.2*/ uint8_t ButtonL2 : 1;
    /*5.3*/ uint8_t ButtonR2 : 1;
    /*5.4*/ uint8_t ButtonShare : 1;
    /*5.5*/ uint8_t ButtonOptions : 1;
    /*5.6*/ uint8_t ButtonL3 : 1;
    /*5.7*/ uint8_t ButtonR3 : 1;
    /*6.1*/ uint8_t ButtonHome : 1;
    /*6.2*/ uint8_t ButtonPad : 1;
    /*6.3*/ uint8_t Counter : 6;
    /*7  */ uint8_t TriggerLeft;
    /*8  */ uint8_t TriggerRight;
    // anything beyond this point, if set, is invalid junk data that was not cleared
};

struct DualSense_USBGetStateData
{ // 63
    /* 0  */ uint8_t LeftStickX;
    /* 1  */ uint8_t LeftStickY;
    /* 2  */ uint8_t RightStickX;
    /* 3  */ uint8_t RightStickY;
    /* 4  */ uint8_t TriggerLeft;
    /* 5  */ uint8_t TriggerRight;
    /* 6  */ uint8_t SeqNo; // always 0x01 on BT
    /* 7.0*/ enum DualSense_Direction DPad : 4;
    /* 7.4*/ uint8_t ButtonSquare : 1;
    /* 7.5*/ uint8_t ButtonCross : 1;
    /* 7.6*/ uint8_t ButtonCircle : 1;
    /* 7.7*/ uint8_t ButtonTriangle : 1;
    /* 8.0*/ uint8_t ButtonL1 : 1;
    /* 8.1*/ uint8_t ButtonR1 : 1;
    /* 8.2*/ uint8_t ButtonL2 : 1;
    /* 8.3*/ uint8_t ButtonR2 : 1;
    /* 8.4*/ uint8_t ButtonCreate : 1;
    /* 8.5*/ uint8_t ButtonOptions : 1;
    /* 8.6*/ uint8_t ButtonL3 : 1;
    /* 8.7*/ uint8_t ButtonR3 : 1;
    /* 9.0*/ uint8_t ButtonHome : 1;
    /* 9.1*/ uint8_t ButtonPad : 1;
    /* 9.2*/ uint8_t ButtonMute : 1;
    /* 9.3*/ uint8_t UNK1 : 1;                // appears unused
    /* 9.4*/ uint8_t ButtonLeftFunction : 1;  // DualSense Edge
    /* 9.5*/ uint8_t ButtonRightFunction : 1; // DualSense Edge
    /* 9.6*/ uint8_t ButtonLeftPaddle : 1;    // DualSense Edge
    /* 9.7*/ uint8_t ButtonRightPaddle : 1;   // DualSense Edge
    /*10  */ uint8_t UNK2;                    // appears unused
    /*11  */ uint32_t UNK_COUNTER;            // Linux driver calls this reserved, tools leak calls the 2 high bytes "random"
    /*15  */ int16_t AngularVelocityX;
    /*17  */ int16_t AngularVelocityZ;
    /*19  */ int16_t AngularVelocityY;
    /*21  */ int16_t AccelerometerX;
    /*23  */ int16_t AccelerometerY;
    /*25  */ int16_t AccelerometerZ;
    /*27  */ uint32_t SensorTimestamp;
    /*31  */ int8_t Temperature; // reserved2 in Linux driver
    /*32  */ struct DualSense_TouchData TouchData;
    /*41.0*/ uint8_t TriggerRightStopLocation : 4; // trigger stop can be a range from 0 to 9 (F/9.0 for Apple interface)
    /*41.4*/ uint8_t TriggerRightStatus : 4;
    /*42.0*/ uint8_t TriggerLeftStopLocation : 4;
    /*42.4*/ uint8_t TriggerLeftStatus : 4;  // 0 feedbackNoLoad
                                             // 1 feedbackLoadApplied
                                             // 0 weaponReady
                                             // 1 weaponFiring
                                             // 2 weaponFired
                                             // 0 vibrationNotVibrating
                                             // 1 vibrationIsVibrating
    /*43  */ uint32_t HostTimestamp;         // mirrors data from report write
    /*47.0*/ uint8_t TriggerRightEffect : 4; // Active trigger effect, previously we thought this was status max
    /*47.4*/ uint8_t TriggerLeftEffect : 4;  // 0 for reset and all other effects
                                             // 1 for feedback effect
                                             // 2 for weapon effect
                                             // 3 for vibration
    /*48  */ uint32_t DeviceTimeStamp;
    /*52.0*/ uint8_t PowerPercent : 4; // 0x00-0x0A
    /*52.4*/ enum DualSense_PowerState PowerState : 4;
    /*53.0*/ uint8_t PluggedHeadphones : 1;
    /*53.1*/ uint8_t PluggedMic : 1;
    /*53.2*/ uint8_t MicMuted : 1; // Mic muted by powersave/mute command
    /*53.3*/ uint8_t PluggedUsbData : 1;
    /*53.4*/ uint8_t PluggedUsbPower : 1;
    /*53.5*/ uint8_t PluggedUnk1 : 3;
    /*54.0*/ uint8_t PluggedExternalMic : 1;  // Is external mic active (automatic in mic auto mode)
    /*54.1*/ uint8_t HapticLowPassFilter : 1; // Is the Haptic Low-Pass-Filter active?
    /*54.2*/ uint8_t PluggedUnk3 : 6;
    /*55  */ uint8_t AesCmac[8];
};

struct DualSense_BTGetStateData
{ // 77
    /* 0*/ struct DualSense_USBGetStateData StateData;
    /*63*/ uint8_t UNK1; // Oscillates between 00101100 and 00101101 when rumbling
                         // Not affected by rumble volume or enhanced vs normal rumble
                         // Audio rumble not yet tested as this is only on BT
    /*64*/ uint8_t BtCrcFailCount;
    /*65*/ uint8_t Pad[11];
};

struct DualSense_ReportIn01USB
{
    uint8_t ReportID; // 0x01
    struct DualSense_USBGetStateData State;
};

struct DualSense_ReportIn01BT
{
    uint8_t ReportID; // 0x01
    struct DualSense_BTSimpleGetStateData State;
};

struct DualSense_ReportIn31
{
    union
    {
        DualSense_BTCRC(78) CRC;
        struct
        {
            uint8_t ReportID;   // 0x31
            uint8_t HasHID : 1; // Present for packets with state data
            uint8_t HasMic : 1; // Looks mutually exclusive, possible mic data
            uint8_t Unk1 : 2;
            uint8_t SeqNo : 4; // unclear progression
            struct DualSense_BTGetStateData State;
        } Data;
    };
};

/* ****** Output Reports ****** */

typedef struct DualSense_SetStateData
{                                                  // 47
    /*    */                                       // Report Set Flags
    /*    */                                       // These flags are used to indicate what contents from this report should be processed
    /* 0.0*/ uint8_t EnableRumbleEmulation : 1;    // Suggest halving rumble strength
    /* 0.1*/ uint8_t UseRumbleNotHaptics : 1;      //
                                                   /*    */
    /* 0.2*/ uint8_t AllowRightTriggerFFB : 1;     // Enable setting RightTriggerFFB
    /* 0.3*/ uint8_t AllowLeftTriggerFFB : 1;      // Enable setting LeftTriggerFFB
                                                   /*    */
    /* 0.4*/ uint8_t AllowHeadphoneVolume : 1;     // Enable setting VolumeHeadphones
    /* 0.5*/ uint8_t AllowSpeakerVolume : 1;       // Enable setting VolumeSpeaker
    /* 0.6*/ uint8_t AllowMicVolume : 1;           // Enable setting VolumeMic
                                                   /*    */
    /* 0.7*/ uint8_t AllowAudioControl : 1;        // Enable setting AudioControl section
    /* 1.0*/ uint8_t AllowMuteLight : 1;           // Enable setting MuteLightMode
    /* 1.1*/ uint8_t AllowAudioMute : 1;           // Enable setting MuteControl section
                                                   /*    */
    /* 1.2*/ uint8_t AllowLedColor : 1;            // Enable RGB LED section
                                                   /*    */
    /* 1.3*/ uint8_t ResetLights : 1;              // Release the LEDs from Wireless firmware control
    /*    */                                       // When in wireless mode this must be signaled to control LEDs
    /*    */                                       // This cannot be applied during the BT pair animation.
    /*    */                                       // SDL2 waits until the SensorTimestamp value is >= 10200000
    /*    */                                       // before pulsing this bit once.
                                                   /*    */
    /* 1.4*/ uint8_t AllowPlayerIndicators : 1;    // Enable setting PlayerIndicators section
    /* 1.5*/ uint8_t AllowHapticLowPassFilter : 1; // Enable HapticLowPassFilter
    /* 1.6*/ uint8_t AllowMotorPowerLevel : 1;     // MotorPowerLevel reductions for trigger/haptic
    /* 1.7*/ uint8_t AllowAudioControl2 : 1;       // Enable setting AudioControl2 section
                                                   /*    */
    /* 2  */ uint8_t RumbleEmulationRight;         // emulates the light weight
    /* 3  */ uint8_t RumbleEmulationLeft;          // emulated the heavy weight
                                                   /*    */
    /* 4  */ uint8_t VolumeHeadphones;             // max 0x7f
    /* 5  */ uint8_t VolumeSpeaker;                // PS5 appears to only use the range 0x3d-0x64
    /* 6  */ uint8_t VolumeMic;                    // not linier, seems to max at 64, 0 is not fully muted
                                                   /*    */
    /*    */                                       // AudioControl
    /* 7.0*/ uint8_t MicSelect : 2;                // 0 Auto
    /*    */                                       // 1 Internal Only
    /*    */                                       // 2 External Only
    /*    */                                       // 3 Unclear, sets external mic flag but might use internal mic, do test
    /* 7.2*/ uint8_t EchoCancelEnable : 1;
    /* 7.3*/ uint8_t NoiseCancelEnable : 1;
    /* 7.4*/ uint8_t OutputPathSelect : 2; // 0 L_R_X
    /*    */                               // 1 L_L_X
    /*    */                               // 2 L_L_R
    /*    */                               // 3 X_X_R
    /* 7.6*/ uint8_t InputPathSelect : 2;  // 0 CHAT_ASR
    /*    */                               // 1 CHAT_CHAT
    /*    */                               // 2 ASR_ASR
    /*    */                               // 3 Does Nothing, invalid
                                           /*    */
    /* 8  */ enum DualSense_MuteLight MuteLightMode;
    /*    */
    /*    */ // MuteControl
    /* 9.0*/ uint8_t TouchPowerSave : 1;
    /* 9.1*/ uint8_t MotionPowerSave : 1;
    /* 9.2*/ uint8_t HapticPowerSave : 1; // AKA BulletPowerSave
    /* 9.3*/ uint8_t AudioPowerSave : 1;
    /* 9.4*/ uint8_t MicMute : 1;
    /* 9.5*/ uint8_t SpeakerMute : 1;
    /* 9.6*/ uint8_t HeadphoneMute : 1;
    /* 9.7*/ uint8_t HapticMute : 1; // AKA BulletMute
                                     /*    */
    /*10  */ uint8_t RightTriggerFFB[11];
    /*21  */ uint8_t LeftTriggerFFB[11];
    /*32  */ uint32_t HostTimestamp;                    // mirrored into report read
                                                        /*    */
    /*    */                                            // MotorPowerLevel
    /*36.0*/ uint8_t TriggerMotorPowerReduction : 4;    // 0x0-0x7 (no 0x8?) Applied in 12.5% reductions
    /*36.4*/ uint8_t RumbleMotorPowerReduction : 4;     // 0x0-0x7 (no 0x8?) Applied in 12.5% reductions
                                                        /*    */
    /*    */                                            // AudioControl2
    /*37.0*/ uint8_t SpeakerCompPreGain : 3;            // additional speaker volume boost
    /*37.3*/ uint8_t BeamformingEnable : 1;             // Probably for MIC given there's 2, might be more bits, can't find what it does
    /*37.4*/ uint8_t UnkAudioControl2 : 4;              // some of these bits might apply to the above
                                                        /*    */
    /*38.0*/ uint8_t AllowLightBrightnessChange : 1;    // LED_BRIHTNESS_CONTROL
    /*38.1*/ uint8_t AllowColorLightFadeAnimation : 1;  // LIGHTBAR_SETUP_CONTROL
    /*38.2*/ uint8_t EnableImprovedRumbleEmulation : 1; // Use instead of EnableRumbleEmulation
                                                        // requires FW >= 0x0224
                                                        // No need to halve rumble strength
    /*38.3*/ uint8_t UNKBITC : 5;                       // unused
                                                        /*    */
    /*39.0*/ uint8_t HapticLowPassFilter : 1;
    /*39.1*/ uint8_t UNKBIT : 7;
    /*    */
    /*40  */ uint8_t UNKBYTE; // previous notes suggested this was HLPF, was probably off by 1
                              /*    */
    /*41  */ enum DualSense_LightFadeAnimation LightFadeAnimation;
    /*42  */ enum DualSense_LightBrightness LightBrightness;
    /*    */
    /*    */                              // PlayerIndicators
    /*    */                              // These bits control the white LEDs under the touch pad.
    /*    */                              // Note the reduction in functionality for later revisions.
    /*    */                              // Generation 0x03 - Full Functionality
    /*    */                              // Generation 0x04 - Mirrored Only
    /*    */                              // Suggested detection: (HardwareInfo & 0x00FFFF00) == 0X00000400
    /*    */                              //
    /*    */                              // Layout used by PS5:
    /*    */                              // 0x04 - -x- -  Player 1
    /*    */                              // 0x06 - x-x -  Player 2
    /*    */                              // 0x15 x -x- x  Player 3
    /*    */                              // 0x1B x x-x x  Player 4
    /*    */                              // 0x1F x xxx x  Player 5* (Unconfirmed)
    /*    */                              //
    /*    */                              //                        // HW 0x03 // HW 0x04
    /*43.0*/ uint8_t PlayerLight1 : 1;    // x --- - // x --- x
    /*43.1*/ uint8_t PlayerLight2 : 1;    // - x-- - // - x-x -
    /*43.2*/ uint8_t PlayerLight3 : 1;    // - -x- - // - -x- -
    /*43.3*/ uint8_t PlayerLight4 : 1;    // - --x - // - x-x -
    /*43.4*/ uint8_t PlayerLight5 : 1;    // - --- x // x --- x
    /*43.5*/ uint8_t PlayerLightFade : 1; // if low player lights fade in, if high player lights instantly change
    /*43.6*/ uint8_t PlayerLightUNK : 2;
    /*    */
    /*    */ // RGB LED
    /*44  */ uint8_t LedRed;
    /*45  */ uint8_t LedGreen;
    /*46  */ uint8_t LedBlue;
    // Structure ends here though on BT there is padding and a CRC, see ReportOut31
} DualSense_USBSetStateData;

struct DualSense_ReportOut02
{
    uint8_t ReportID; // 0x02
    DualSense_USBSetStateData State;
};

struct DualSense_ReportOut31
{
    union
    {
        DualSense_BTCRC(78) CRC;
        struct
        {
            uint8_t ReportID;      // 0x31
            uint8_t UNK1 : 1;      // -+
            uint8_t EnableHID : 1; //  | - these 3 bits seem to act as an enum
            uint8_t UNK2 : 1;      // -+
            uint8_t UNK3 : 1;
            uint8_t SeqNo : 4; // increment for every write // we have no proof of this, need to see some PS5 captures
            struct DualSense_SetStateData State;
        } Data;
    };
};

/* ****** Feature Reports ****** */
/* Calibration */
/* Reading calibration is required to switch BT input reports from
 the truncated 0x01 report to the expanded 0x31 report. */

/* Linux hid-sony.c (does this apply to the DualSense?) */

struct DualSense_ReportFeatureInCalibrateBT
{
    union
    {
        DualSense_BTCRC(41) CRC;
        struct
        {
            uint8_t ReportID; // 0x05 // does this exist on USB? confirm
            int16_t GyroPitchBias;
            int16_t GyroYawBias;
            int16_t GyroRollBias;
            int16_t GyroPitchPlus;
            int16_t GyroPitchMinus;
            int16_t GyroYawPlus;
            int16_t GyroYawMinus;
            int16_t GyroRollPlus;
            int16_t GyroRollMinus;
            int16_t GyroSpeedPlus;
            int16_t GyroSpeedMinus;
            int16_t AccelXPlus;
            int16_t AccelXMinus;
            int16_t AccelYPlus;
            int16_t AccelYMinus;
            int16_t AccelZPlus;
            int16_t AccelZMinus;
            int16_t Unknown;
        } Data;
    };
};

struct DualSense_ReportFeatureInMacAll
{
    uint8_t ReportID;     // 0x09
    uint8_t ClientMac[6]; // Right to Left
    uint8_t Hard08;
    uint8_t Hard25;
    uint8_t Hard00;
    uint8_t HostMac[6]; // Right to Left
    uint8_t Pad[3];     // Size according to Linux driver
};

struct DualSense_ReportFeatureInVersion
{
    union
    {
        DualSense_BTCRC(64) CRC;
        struct
        {
            uint8_t ReportID;   // 0x20
            char BuildDate[11]; // string
            char BuildTime[8];  // string
            uint16_t FwType;
            uint16_t SwSeries;
            uint32_t HardwareInfo;    // 0x00FF0000 - Variation
                                      // 0x0000FF00 - Generation
                                      // 0x0000003F - Trial?
                                      // ^ Values tied to enumerations
            uint32_t FirmwareVersion; // 0xAABBCCCC AA.BB.CCCC
            char DeviceInfo[12];
            ////
            uint16_t UpdateVersion;
            char UpdateImageInfo;
            char UpdateUnk;
            ////
            uint32_t FwVersion1; // AKA SblFwVersion
                                 // 0xAABBCCCC AA.BB.CCCC
                                 // Ignored for FwType 0
                                 // HardwareVersion used for FwType 1
